---
kind: type
id: T:Autodesk.Revit.UI.ITemporaryGraphicsHandler
source: html/d512f108-eaea-ad59-92fc-ed73287526e2.htm
---
# Autodesk.Revit.UI.ITemporaryGraphicsHandler

Interface class for external server of TemporaryGraphicsHandlerService .

## Syntax (C#)
```csharp
public interface ITemporaryGraphicsHandler : IExternalServer
```